{
  "sponsors": {
    "platine": [
      {
        "name": "lunatech",
        "url": "https://lunatech.com/"
      },
      {
        "name": "strangebee",
        "url": "https://www.strangebee.com/"
      }
    ],
    "gold": [
      {
        "name": "reach5",
        "url": "https://www.reachfive.com/"
      },
      {
        "name": "gatling",
        "url": "https://gatling.io/"
      },
      {
        "name": "starlake",
        "url": "https://www.starlake.ai"
      }
    ],
    "silver": [
      {
        "name": "hawk",
        "url": "https://hawk-tech.io/"
      },
      {
        "name": "colisweb",
        "url": "https://www.colisweb.com"
      }
    ],
    "jaimescala": [
      {
        "name": "besodo",
        "url": "https://besedo.com/"
      },
      {
        "name": "rudder",
        "url": "https://www.rudder.io/"
      },
      {
        "name": "univalence",
        "url": "https://univalence.io/"
      },
      {
        "name": "fptower",
        "url": "https://www.fp-tower.com/"
      }
    ]
  },
  "contributions": [
    {
      "year": 2019,
      "contributors": [
        {
          "name": "Olivier CHIROUZE",
          "twitter": "https://twitter.com/OlivierChirouze",
          "company": "Criteo"
        },
        {
          "name": "Brice LAURENCIN",
          "company": "Criteo"
        },
        {
          "name": "Rémi LAVOLÉE",
          "company": "Ubilab"
        },
        {
          "name": "Guillaume NOIREAUX",
          "company": "Ubilab"
        },
        {
          "name": "Guillaume BADIN",
          "twitter": "http://twitter.com/guillaumebadin",
          "company": "Ubilab"
        }
      ]
    },
    {
      "year": 2018,
      "contributors": [
        {
          "name": "Francois ARMAND",
          "twitter": "http://twitter.com/fanf42",
          "company": "www.normation.com"
        },
        {
          "name": "Karol CHMIST",
          "twitter": "http://twitter.com/karolchmist",
          "company": "Freelance"
        }
      ]
    },
    {
      "year": 2017,
      "contributors": [
        {
          "name": "Emmanuel FELLER",
          "twitter": "http://twitter.com/moyowi",
          "company": "innovation-box.fr"
        }
      ]
    },
    {
      "year": 2016,
      "contributors": [
        {
          "name": "Emmanuel FELLER",
          "twitter": "http://twitter.com/moyowi",
          "company": "innovation-box.fr"
        },
        {
          "name": "Andy HICKS",
          "twitter": "http://twitter.com/andy1138",
          "company": "Freelance"
        },
        {
          "name": "Guillaume BADIN",
          "twitter": "http://twitter.com/guillaumebadin",
          "company": "Ubilab"
        }
      ]
    },
    {
      "year": 2014,
      "contributors": [
        {
          "name": "Emmanuel FELLER",
          "twitter": "http://twitter.com/moyowi",
          "company": "innovation-box.fr"
        },
        {
          "name": "Andy HICKS",
          "twitter": "http://twitter.com/andy1138",
          "company": "Freelance"
        }
      ]
    }
  ],
  "speakers": {
    "keynote": [
      {
        "name": "Martin Odersky",
        "speaker-title": "Academic Director - EPFL",
        "id": "martin-odersky",
        "email": "_",
        "avatar": "https://secure.gravatar.com/avatar/1d3a514afe5f1074ca145ec82eedf8fd?s=500",
        "location": "Unknown",
        "bio": "Martin Odersky heads the programming research group at EPFL. His research interests cover fundamental as well as applied aspects of programming languages. They include semantics, type systems, programming language design, and compiler construction. The main focus if his work lies in the integration of object-oriented and functional programming. His research thesis is that the two paradigms are just two sides of the same coin and should be unified as much as possible. To prove this he has experimented a number of language designs, from Pizza to GJ to Functional Nets. He has also influenced the development of Java as a co-designer of Java generics and as the original author of the current javac reference compiler. His current work concentrates on the Scala programming language, which unifies FP and OOP, while staying completely interoperable with Java and .NET. Martin Odersky got his doctorate from ETHZ, in 1989. He held research positions at the IBM T.J. Watson Research Center from 1989 and at Yale University from 1991. He was then a professor at the University of Karlsruhe from 1993 and at the University of South Australia from 1997. He joined EPFL as full professor in 1999. He is associate editor of the Journal of Functional Programming and member of IFIP WG 2.8. He was conference chair for ICFP 2000, and program chair for ECOOP 2004 as well as ETAPS/CC 2007",
        "twitter": "JulienTruffaut",
        "url": "https://scalajobs.com/",
        "organization": "EPFL",
        "shirt_size": "Men's M",
        "talk_format": "Talk (45 minutes)",
        "title": "Opening keynote",
        "abstract": "",
        "description": "Opening keynote",
        "notes": "",
        "audience_level": "All",
        "tags": [],
        "rating": 0.0,
        "state": "accepted",
        "confirmed": false,
        "created_at": "2022-08-09T12:31:58.325Z",
        "additional_info": null
      }
    ],
    "talk": [
      {
        "name": "Nicolas Rinaudo",
        "id": "nicolas-rinaudo",
        "speaker-title" : "Scala & FP enthusiast",
        "email": "nicolas@nrinaudo.com",
        "avatar": "https://secure.gravatar.com/avatar/3d4cd92195bb4a21bed5eade58836f05?s=500",
        "location": "Paris, France",
        "bio": "Nicolas writes code for JPMorgan, where we use Scala to make some very complicated things seem very simple.\r\n\r\nAfter too many years as a Java programmer and a thankfully brief stint in marketing, Nicolas discovered Functional Programming through Scala and fell in love. Since then, he's made it his mission to learn and explain the scary bits, by focusing on practical applications.\r\n\r\nNicolas is also the author and sole maintainer of a few useful OSS libraries, such as [kantan.csv](https://nrinaudo.github.io/kantan.csv/).",
        "twitter": "NicolasRinaudo",
        "url": "",
        "organization": "JPMorgan",
        "shirt_size": "Men's M",
        "talk_format": "Talk (45 minutes)",
        "title": "Function reuse is just wishful thinking",
        "abstract": "Functors, monads, etc... can be both very useful and extremely intimidating.\n\nThis talk will introduce and justify them in a real life scenario, staying away from their more academic interpretations. It will allow attendants to build a solid intuition for the problems they actually solve.",
        "description": "The Function Programming literature is full of words like Monad, Functor, ... which can be a little bit intimidating at first. Most explanations tend to not help much with that - encoding effects, category theory... this can be properly terrifying for down-to-earth developers that just want to write some code.\r\n\r\nThe purpose of this talk is to show how these abstractions come up very naturally in very concrete projects, and how they allow you to think about the problem you're trying to solve rather than focus on irrelevant noise.\r\n\r\nAt the end of the talk, attendants will have a solid intuition for what Functor, Apply, Applicative, FlatMap and Monad are, what problem they solve and how, and when (or when not) to use them.",
        "notes": "I've always felt that monad tutorials, and categorical abstraction tutorials in general, focused a little too much on *what* these things are rather than *why* they exist. As a mostly hands on developer with little academic background, this is exactly how to make sure I do not understand a subject.\r\n\r\nThis talk is about taking the approach I wish someone had used to teach me: show a problem, build a solution for it, and then tie it to these things smart people talk about that I don't understand.\r\n\r\nI make a point of using Scala 3 for this talk, although it doesn't go much further than givens and extension methods.",
        "audience_level": "All",
        "tags": [
          "Scala",
          "monad",
          "functor",
          "applicative",
          "apply",
          "flatmap"
        ],
        "rating": 0.0,
        "state": "accepted",
        "confirmed": true,
        "created_at": "2022-08-23T19:57:02.997Z",
        "additional_info": null
      },{
        "name": "Jules Ivanic",
        "id": "jules-ivanic",
        "speaker-title": "Functional Programmer",
        "email": "jules.ivanic@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/715090826868a4a97ffd8cd2cd4c18bc?s=500",
        "location": "Unknown",
        "bio": "Product Engineer, Senior Software Engineer, Functional Programmer.\r\n\r\nI code with Scala for more than 8 years and with the FP style for more than 5 years.\r\nI'm currently a Tech Lead at Conduktor, leading the development of one of the products of the company.\r\nI'm a French citizen and an Australian permanent resident. \r\nI live in Margaret River, WA. A small town in the middle of nowhere known internationally for its world-class wine and its world-class waves.",
        "twitter": "guizmaii",
        "url": "",
        "organization": "Conduktor",
        "shirt_size": "Men's M",
        "talk_format": "Talk (45 minutes)",
        "title": "Cost-effective and easy to maintain GraphQL API integration tests with zio-test and Caliban",
        "abstract": "Let's study together how Scala, zio-test and Caliban are, each with their own capabilities, helping us in this difficult task of writing and maintaining a production-ready software integration tests suite on a GraphQL API.",
        "description": "Production-ready software requires testing before it goes into production. As the discipline of software development matured, software testing approaches have matured too. Instead of having myriads of manual software testers, development teams have moved towards automating the biggest portion of their testing efforts. Automating their tests allows teams to know whether their software is broken in a matter of seconds and minutes instead of days and weeks.\r\n\r\nThe drastically shortened feedback loop fuelled by automated tests goes hand in hand with agile development practices, continuous delivery and DevOps culture. Having an effective software testing approach allows teams to move fast and with confidence.\r\n\r\nIf you want to get serious about automated tests for your software, there is one key concept you should know about: the test pyramid. Mike Cohn came up with this concept in his book Succeeding with Agile. It's a great visual metaphor telling you to think about different layers of testing. It also tells you how much testing to do on each layer.\r\n\r\nStick to the pyramid shape to come up with a healthy, fast and maintainable test suite: Write lots of small and fast unit tests. Write some more coarse-grained tests and very few high-level tests that test your application from end to end. Watch out that you don't end up with a test ice-cream cone that will be a nightmare to maintain and takes way too long to run.\r\n\r\nIn this talk, I'd like to introduce you to the practices helping our team to keep our integration tests suite, or Service Tests suite, a bliss to maintain.\r\n\r\nThese practices can be summarized into 3 main points:\r\n  - Write your integration tests alongside your app code\r\n  - Use the same tools that you're using to write your app code and unit tests\r\n  - Generate as much code as possible\r\n\r\nWe'll see in this talk how Scala, zio-test and Caliban are, each with their own capabilities, helping us in this difficult task of writing and maintaining a production-ready software integration tests suite.",
        "notes": "",
        "audience_level": "Intermediate",
        "tags": [
          "Scala",
          "FP",
          "GraphQL",
          "API",
          "tests",
          "integration-tests",
          "ZIO"
        ],
        "rating": 0.0,
        "state": "accepted",
        "confirmed": true,
        "created_at": "2022-08-23T13:34:00.299Z",
        "additional_info": null
      },{
        "name": "Julien Truffaut",
        "id": "julien-truffaut",
        "speaker-title": "FP & Scala instructor",
        "email": "truffaut.julien@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/1d3a514afe5f1074ca145ec82eedf8fd?s=500",
        "location": "Unknown",
        "bio": "I am a backend engineer with more than 10 years of experience from start-ups to tech giants like Amazon.\r\nI love teaching the practical side of functional programming in Scala. I created my own online course at FP-Tower which is used by many companies to train junior and mid-level Scala developers.\r\nI am also the author of the popular open-source library Monocle, an optics library that helps functional Scala developers easily traverse, transform, and access deeply nested data structures.",
        "twitter": "JulienTruffaut",
        "url": "https://scalajobs.com/",
        "organization": "ScalaJobs",
        "shirt_size": "Men's M",
        "talk_format": "Talk (45 minutes)",
        "title": "Implicit parameters, when to use them (or not)!",
        "abstract": "Implicits values are one of the unique features of Scala but they are very complex and easy to misuse. So in this talk we will discuss various valid use cases and anti-pattern for implicits. \n\nYou don’t need to be a Scala expert, I will also present how implicit works at high level.",
        "description": "Implicits values are one of the unique features of Scala but they are very complex and easy to misuse. So in this talk we will discuss various valid use cases and anti-pattern for implicits. \r\n\r\nYou don’t need to be a Scala expert, I will also present how implicit works at high level.",
        "notes": "I can make this presentation in French or in English.",
        "audience_level": "All",
        "tags": [],
        "rating": 0.0,
        "state": "accepted",
        "confirmed": false,
        "created_at": "2022-08-09T12:31:58.325Z",
        "additional_info": null
      },{
        "name": "Daniel Beskin",
        "id": "daniel-beskin",
        "speaker-title": "Tech lead",
        "email": "daniel.beskin@gmail.com",
        "avatar": "https://secure.gravatar.com/avatar/cfea56c4aaf43e0ba31a5db5dca31935?s=500",
        "location": "Unknown",
        "bio": "Daniel is a somewhat functional developer who's convinced that the best way to learn something is to teach it.",
        "twitter": "",
        "url": "http://ncreep.github.io/language_perils/",
        "organization": "",
        "shirt_size": "Men's XL",
        "talk_format": "Talk (45 minutes)",
        "title": "Category Theory as a Tool for Thought",
        "abstract": "By rephrasing various FP idioms in the language of Category Theory, we can systematically tackle concepts by deconstructing them and deriving new ideas from them. That is, we can use Category Theory as a tool—a tool for thought.",
        "description": "The influence of Category Theory on statically-typed Functional Programming is undeniable. The liberal usage of terms such as \"Functor\" and \"Monad\" seems to prove this point. Category Theory is certainly a rich source of ideas, but one gets the impression that it is more than just that. Proficiency in Category Theory appears to enable software developers to explore new concepts and abstractions in a more far-reaching and systematic way.\r\n\r\nOn closer inspection, this should not come as a surprise. Category Theory can be seen as being about defining concepts by their relationships to one another. Sometimes, this allows finding and exploring new ideas by just \"following the arrows\", which is one of the many useful exploration techniques to be found in a Category Theorist's toolbox.\r\n\r\nIn this talk, I will try to demonstrate some of these exploration techniques by developing and analyzing examples from the world of Functional Programming phrased in the language of Category Theory. We will see how this enables us to systematically tackle concepts by deconstructing them and deriving new ideas from them. That is, we will use Category Theory as a tool—a tool for thought.",
        "notes": "The aim of the talk is to show the audience how it is possible to use Category Theory to explore the \"idea space\" and to discover new, and sometimes practically useful, ideas.\r\n\r\nThe talk will assume some basic proficiency with some of the more common abstractions in Functional Programming, such as, Functors and Monads.\r\n",
        "audience_level": "Intermediate",
        "tags": [
          "category theory"
        ],
        "rating": 0.0,
        "state": "waitlist",
        "confirmed": false,
        "created_at": "2022-07-21T21:30:46.192Z",
        "additional_info": null
      },
      {
        "name": "Chris Kipp",
        "id" : "chris-kipp",
        "speaker-title" : "Maintainer on Scalameta/metals",
        "email": "ckipp@protonmail.com",
        "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/62165/me.jpeg",
        "location": "Den Haag",
        "bio": "Chris Kipp is a Software Engineer at [Lunatech](https://www.lunatech.com/). He's an avid fan of NeoVim, simple tech, and enjoys working on tooling. He's one of the maintainers of Metals, the Scala language server, an active open source contributor, and host of the [Tooling Talks](https://www.tooling-talks.com/) podcast.",
        "twitter": "ckipp01",
        "url": "https://chris-kipp.io",
        "organization": "Lunatech",
        "shirt_size": "Men's M",
        "talk_format": "Talk (45 minutes)",
        "title": "The Journey of a Dotty Diagnostic",
        "abstract": "Diagnostics seem simple enough -- you have some message, a position that relates to it, and a severity level. However, what else could diagnostics tell us? How else could we use them? How does a diagnostic even get from the compiler to your editor? Let's follow the journey of a Dotty diagnostic.",
        "description": "In this talk we do a deep dive into a seemingly simple topic, diagnostics in Dotty. For a long time we've settled for the bare minimum information when it comes to diagnostics: a message, a position, and a severity level. However, other languages like Rust and Elm have challenged this idea providing rich structured diagnostic information that tools can use. What if we started to expand the diagnostics information dotc provides? How could this help our tooling? There is [ongoing work](https://github.com/lampepfl/dotty/issues/14904) on this and the changes necessary to the ecosystem are much wider than you'd expect.\r\n\r\nFollow along as we trace the journey of a diagnostic starting from the base traits in sbt/zinc, through dotc, through your build tool, through your language server, and finally to your editor. At the end of this talk you'll have a much richer understanding of how diagnostics are created, handled, and forwarded. You'll also see some examples of how things like code actions in Metals become much easier with this structured information.",
        "notes": "This is a topic I've been personally working on in [dotty](https://github.com/lampepfl/dotty/issues/14904) and originally drove the conversation around it in [the contributor forum](https://contributors.scala-lang.org/t/revisiting-dotty-diagnostics-for-tooling/5649). I also help maintain many of the tools that this will benefit such as [Metals](https://github.com/scalameta/metals).\r\n\r\nNote that this is a sponsored talk from Lunatech Labs, one of the Platinum sponsors.",
        "audience_level": "All",
        "tags": [
          "scala",
          "lsp",
          "bsp",
          "tooling"
        ],
        "rating": 0.0,
        "state": "accepted",
        "confirmed": true,
        "created_at": "2022-09-06T14:25:04.983Z",
        "additional_info": null
      }
    ]
  },
  "schedule" : [
    {
      "typ": "Single",
      "time": "08:00 - 09:00",
      "items" : ["Registration"]

    },{
      "typ": "Single",
      "time": "09:00 - 09:20",
      "items" : ["Introduction"]

    },{
      "typ": "Single",
      "time": "09:25 - 10:20",
      "items" : ["Opening Keynote"]

    },{
      "typ": "Double",
      "time": "10:30 - 11:00",
      "items" : ["talk", "talk"]

    },{
      "typ": "Double",
      "time": "11:05 - 11:35",
      "items" : ["talk", "talk"]

    },{
      "typ": "Double",
      "time": "11:40 - 12:25",
      "items" : ["talk", "talk"]

    },{
      "typ": "Single",
      "time": "12h25 - 13:15",
      "items" : ["Lunch break"]

    },{
      "typ": "Double",
      "time": "13:15 - 13:50",
      "items" : ["Talk", "talk"]

    },{
      "typ": "Double",
      "time": "13:55 - 14:35",
      "items" : ["Talk", "talk"]

    },{
      "typ": "Double",
      "time": "14:40 - 15:25",
      "items" : ["Talk", "talk"]

    },{
      "typ": "Double",
      "time": "15:30 - 16:15",
      "items" : ["Talk", "talk"]

    },{
      "typ": "Single",
      "time": "16:15 - 16:35",
      "items" : ["Coffee Break"]

    },{
      "typ": "Double",
      "time": "16:35 - 17:20",
      "items" : ["Talk", "talk"]

    },{
      "typ": "Single",
      "time": "17:25 - 18:20",
      "items" : ["Closing Keynote"]
    }
  ]
}

